// 1. С помощью цикла while вывести все простые числа в промежутке от 0 до 100.

var i = 1;
var mas = [];
while (i <= 100) {
    var n = 2;
    while (n <= i) {
        if (n == i) {
            mas.push(i);
        }
        n++;
        if (i % (n - 1) == 0) {
            break;
        }
    }
    i++;
}
alert(mas);


// 2. С этого урока начинаем работать с функционалом интернет-магазина. Предположим, есть сущность корзины. Нужно реализовать функционал подсчета стоимости корзины в зависимости от находящихся в ней товаров.

// 3. Товары в корзине хранятся в массиве. Задачи:
// a) Организовать такой массив для хранения товаров в корзине;
// b) Организовать функцию countBasketPrice, которая будет считать стоимость корзины.

var g1 = +prompt("Задайте количество Товара 1");
var g2 = +prompt("Задайте количество Товара 2");
var g3 = +prompt("Задайте количество Товара 3");

var goods = [
    {
        title: "Товар 1",
        price: 100,
        count: g1,

    },
    {
        title: "Товар 2",
        price: 200,
        count: g2,
    },
    {
        title: "Товар 3",
        price: 300,
        count: g3,
    }
];

function countBasketPrice(x, y) {
    var mult = x * y;
    return mult;
}

var s = 0;
for (var item of goods) {
    s += countBasketPrice(item.price, item.count);
}
alert(s);

// 4.*Вывести с помощью цикла for числа от 0 до 9, не используя тело цикла. Выглядеть это должно так:
// for(…){// здесь пусто}

for (i = 0; i <= 9; console.log(i++)) { /*здесь пусто*/ };

// 5. *Нарисовать пирамиду с помощью console.log, как показано на рисунке, только у вашей пирамиды должно быть 20 рядов, а не 5:
// x
// xx
// xxx
// xxxx
// xxxxx

var s = "";
for (i = 1; i <= 20; i++) {
    s += "*"
    console.log(s);
}